// 年龄与疾病
//     某医院想统计一下某项疾病的获得与否与年龄是否有关，需要对以前的诊断记录进行整理，按照0-18、19-35、36-60、61以上（含61）四个年龄段统计的患病人数占总患病人数的比例。
// 输入:
//     共2行，第一行为过往病人的数目n（0<n<=100)，第二行为每个病人患病时的年龄。
// 输出:
//     按照0-18、19-35、36-60、61以上(含61)四个年龄段输出该段患病人数占总患病人数的比例，以百分比的形式输出，精确到小数点后两位。每个年龄段占一行，共四行。
// 样例输入:
//     10
//     1 11 21 31 41 51 61 71 81 91
// 样例输出:
//     20.00%
//     20.00%
//     20.00%
//     40.00%
#include<iostream>
#include<iomanip>
using namespace std;
int main()
{
    int n;
    cin>>n;
    int a[4]={0,0,0,0};
    for (int i=0;i<n;i++)
    {
        int age;
        cin>>age;
        if(age>=0&&age<=18)
        {
            a[0]++;
        }
        else if(age>=19&&age<=35)
        {
            a[1]++;
        }
        else if(age>=36&&age<=60)
        {
            a[2]++;
        }
        else 
        {
            a[3]++;
        }
    }
    for (int i=0;i<4;i++)
    {
        cout<<fixed<<setprecision(2)<<100/(1.0*n/a[i])<<"%"<<endl;
    }
    return 0;
}